#+title: Understanding Database Seeders
#+auther: kenjirofukuda
#+options: toc:nil num:nil ^:nil
#+HTML_HEAD_EXTRA: <style> .figure p {text-align: left;}</style>
#+HTML_HEAD_EXTRA: <script src="https://cdn.jsdelivr.net/npm/mermaid@11.12.0/dist/mermaid.min.js"></script>

- @see https://laracasts.com/series/30-days-to-learn-laravel-11/episodes/15

* 柔軟性のための分割シーダー
#+begin_quote
データベースのさまざまな部分に対して複数のシーダー クラスを作成できます。
#+end_quote

#+begin_src bash :results raw
  php artisan make:seeder JobSeeder
#+end_src

#+begin_example
   INFO  Seeder [database/seeders/JobSeeder.php] created successfully.
#+end_example


#+caption: 生成されたJobSeeder.phpのテンプレート
#+begin_src php
<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class JobSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
    }
}
#+end_src

ここに先程の200件Job追加のコードを移動し、大本の =DatabaseSeeder= はそのクラスを呼び出すと自動的に =run()= が呼び出されます。

#+caption: JobSheederの修正
#+begin_src diff
modified   database/seeders/JobSeeder.php
@@ -2,6 +2,7 @@
 
 namespace Database\Seeders;
 
+use App\Models\Job;
 use Illuminate\Database\Console\Seeds\WithoutModelEvents;
 use Illuminate\Database\Seeder;
 
@@ -12,6 +13,6 @@ class JobSeeder extends Seeder
      */
     public function run(): void
     {
-        //
+        Job::factory(200)->create();
     }
 }
#+end_src

#+caption: DatabaseSheederの修正
#+begin_src diff
modified   database/seeders/DatabaseSeeder.php
@@ -2,6 +2,7 @@
 
 namespace Database\Seeders;
 
+use App\Models\Job;
 use App\Models\User;
 // use Illuminate\Database\Console\Seeds\WithoutModelEvents;
 use Illuminate\Database\Seeder;
@@ -20,5 +21,7 @@ public function run(): void
             'last_name' => 'User',
             'email' => 'test@example.com',
         ]);
+
-        Job::factory(200)->create();
+        $this->call(JobSeeder::class);
     }
 }
#+end_src


#+begin_src bash :results raw
  php artisan migrate:fresh --seed
#+end_src

#+begin_example

  Dropping all tables ............................................ 3.20ms DONE

   INFO  Preparing database.  

  Creating migration table ...................................... 17.02ms DONE

   INFO  Running migrations.  

  0001_01_01_000000_create_users_table .......................... 52.21ms DONE
  0001_01_01_000001_create_cache_table .......................... 14.03ms DONE
  0001_01_01_000002_create_jobs_table ........................... 37.00ms DONE
  2025_10_15_225729_create_job_listings_table ................... 11.02ms DONE
  2025_10_16_013633_create_posts_table ........................... 7.16ms DONE
  2025_10_16_174339_create_employers_table ....................... 7.01ms DONE
  2025_10_22_005338_create_tags_table ........................... 17.12ms DONE


   INFO  Seeding database.  

  Database\Seeders\JobSeeder ......................................... RUNNING  
  Database\Seeders\JobSeeder ................................... 2,958 ms DONE  
#+end_example

シーダークラスを分けることにより単体で実行することが可能となります。

#+begin_quote
これにより、シーダーを個別またはグループで実行できるようになり、テストや部分的なデータ更新に役立ちます。
で、他のシーダーを呼び出します。
#+end_quote

#+caption: DatabaseSeeder 
#+begin_src php
public function run()
{
    $this->call([
        UserSeeder::class,
        JobSeeder::class,
    ]);
}
#+end_src

=DatabaseSeeder= というクラス名はシーダークラスを指定しない場合のデフォルトを意味します。引数を省略すると =DatabaseSheeder= の =run= が呼び出されます。

#+begin_src bash :results raw
php artisan help db:seed
#+end_src

#+begin_example
Description:
  Seed the database with records

Usage:
  db:seed [options] [--] [<class>]

Arguments:
  class                      The class name of the root seeder

Options:
      --class[=CLASS]        The class name of the root seeder [default: "Database\Seeders\DatabaseSeeder"]
      --database[=DATABASE]  The database connection to seed
      --force                Force the operation to run when in production
  -h, --help                 Display help for the given command. When no command is given display help for the list command
      --silent               Do not output any message
  -q, --quiet                Only errors are displayed. All other output is suppressed
  -V, --version              Display this application version
      --ansi|--no-ansi       Force (or disable --no-ansi) ANSI output
  -n, --no-interaction       Do not ask any interactive question
      --env[=ENV]            The environment the command should run under
  -v|vv|vvv, --verbose       Increase the verbosity of messages: 1 for normal output, 2 for more verbose output and 3 for debug
#+end_example

クラスを単体で指定するオプションがあります。
#+begin_example
      --class[=CLASS]        The class name of the root seeder [default: "Database\Seeders\DatabaseSeeder"]
#+end_example

#+caption: JobSeeder単体を実行
#+begin_src bash :results raw
  php artisan db:seed --class=JobSeeder
#+end_src

#+begin_example
   INFO  Seeding database.  
#+end_example


#+begin_src bash :results raw :exports both :eval no-export :dir (file-name-directory (buffer-file-name))
sqlite3 ./database/database.sqlite <<EOF
.mode table
select count(*) as count from "job_listings";
.quit
EOF
#+end_src

#+RESULTS:
+-------+
| count |
+-------+
| 400   |
+-------+

初期の200件+今回の単体シードで計400件のデータになっています。

